Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་གྲགས་ཆེན་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a religious and righteous king named Mahāyasyā.

source: རྫུ་འཕྲུལ་ཆེ་བ་གཟི་བརྗིད་ཆེ་བ་མཐུ་ཆེ་བ་ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་རྣམས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཞིག་བྱུང་ངོ་། །
en: This king possessed tremendous miraculous powers and splendor, and he had attained freedom from attachment to pleasures by means of the outer path.

source: དེ་མི་ཐམས་ཅད་ཀྱི་ཚེས་བཅྭ་ལྔ་སྟེ་ཟླ་བ་ཉ་ལ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱི་འདུན་ཁང་དུ་འགྲོ་སྟེ། དེ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་ལྷན་ཅིག་ཏུ་ཆོས་ཀྱི་བགྲོ་བ་བྱེད་དོ། །
en: On the fifteenth day of the bright fortnight, the day of the full moon, King Mahāyasyā went to the assembly hall of the gods of the Heaven of the Thirty-Three to participate in a Dharma discussion.

source: གྲོགས་པོ་དག་གལ་ཏེ་བརྒྱ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་ན་ཆོས་གང་དག་སྟོན་པ་ནི་མཛད་པ་དང་ལྡན་ནོ། །
en: Once there, he said, ‘Friends, whenever a thus-gone, worthy, perfect buddha appears in the world, then whatever Dharma that buddha teaches is endowed with activity.’

source: དེའི་ཚེ་རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་ཞེས་བྱ་བ་དང་། རྒྱལ་པོ་ཁྱབ་འཇུག་བློ་གྲོས་ཞེས་བྱ་བ་དང་། རྒྱལ་པོ་ཟླ་བའི་བློ་གྲོས་ཞེས་བྱ་བ་དང་། རྒྱལ་པོ་ཐིགས་པའི་བློ་གྲོས་ཞེས་བྱ་བ་དང་། རྒྱལ་པོ་མེ་ཏོག་བློ་གྲོས་ཞེས་བྱ་བ་དང་། རྒྱལ་པོ་ཤུགས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བ་དང་། རྒྱལ་པོ་སྐར་འོད་ཅེས་བྱ་བ་དང་། རྒྱལ་པོ་སྤྲིན་གྱི་བློ་གྲོས་ཞེས་བྱ་བ་དང་། རྒྱལ་པོ་ཟླ་བ་དྲི་མེད་བློ་གྲོས་ཞེས་བྱ་བ་དང་། དེ་དག་ལ་སོགས་པ་རྒྱལ་པོ་ཁྲི་ཕྲག་དགུ་དག་སུམ་ཅུ་རྩ་གསུམ་གྱི་འདུན་ཁང་དུ་དོང་སྟེགང་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་ལྷན་ཅིག་ཏུ་ཆོས་བགྲོ་བ་བྱེད་དོ། །
en: “At that point ninety thousand kings appeared at the assembly hall, including King Topmost Intelligence, King Viṣnumati, King Candramati, King Drop of Intelligence, King Flower Intelligence, King Powerful Intelligence, King Starlight, King Cloud of Intelligence, and King Vimala­candra­mati.

source: གྲོགས་པོ་དག་ཆོས་སྨྲ་བ་དག་གི་ཕྱོགས་སུ་བྱ་ཞིང་ཆོས་མ་ཡིན་པ་སྨྲ་བ་དག་གི་མི་བྱ།
en: Participating in the Dharma discussion, the kings advised, ‘Friends, we must follow those who teach the Dharma, not those who teach non-Dharma.

source: ཡང་དག་པར་སྨྲ་བ་དག་གི་ཕྱོགས་སུ་བྱ་ཞིང་ཡང་དག་པ་མ་ཡིན་པ་སྨྲ་བ་དག་གི་མི་བྱ།
en: We must follow those who teach the genuine, not those who deny the genuine.

source: ཞི་བ་སྨྲ་བ་དག་གི་ཕྱོགས་སུ་བྱ་ཞིང་ཞི་བ་མ་ཡིན་པ་སྨྲ་བ་དག་གི་མི་བྱ།
en: We must follow those who teach peace, not those who deny peace.

source: བདེན་པ་སྨྲ་བ་དག་གི་ཕྱོགས་སུ་བྱ་ཞིང་བདེན་པ་མ་ཡིན་པ་སྨྲ་བ་དག་གི་མི་བྱ།
en: We must follow those who teach the truth, not those who deny the truth.

source: གྲོགས་པོ་དག་སྟོང་པ་ཉིད་སྨྲ་བ་དག་གི་ཕྱོགས་སུ་བྱ་ཞིང་། སྟོང་པ་ཉིད་མ་ཡིན་པར་སྨྲ་བ་དག་གི་མི་བྱ།
en: Friends, we must follow those who teach emptiness, not those who deny emptiness.

source: གྲོགས་པོ་དག་བདག་མེད་པ་སྨྲ་བ་དག་གི་ཕྱོགས་སུ་བྱ་ཞིང་བདག་ཏུ་སྨྲ་བ་དག་གི་མི་བྱ།
en: Friends, we must follow those who teach that there is no self, not those who teach in terms of a self.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ནི་སྟོང་པ་ཉིད་གསུང་སྟེ། གང་ཟག་མི་གསུང་ངོ་། །
en: The blessed buddhas speak of emptiness, not persons.

source: གྲོགས་པོ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་ནང་དང་ཕྱིའི་སྐྱེ་མཆེད་བཅུ་གཉིས་དག་ངོ་བོ་ཉིད་དང་བྲལ་བར་གསུངས་སོ། །
en: Friends, the blessed buddhas declare that the twelve inner and outer sense sources are devoid of any essential nature.’

source: དེ་ལ་ལྷའི་འཁོར་མང་པོ་དག་གིས་སྒྲ་ཆེན་པོ་དང་སྒྲ་གསལ་བར་སྨྲས་པ།
en: “At that point many in the circle of gods exclaimed loudly and with a clear voice,

source: གྲོགས་པོ་དག་སྟོང་པ་ཉིད་ལ་ལས་མངོན་པར་འདུ་བྱེད་པ་ཇི་ལྟར་ཡོད།
en: ‘Friends, how could there be any acts of karmic formation within emptiness?

source: གལ་ཏེ་བདག་དང་བདག་གི་མེད་ན་ལྷའི་འཁོར་འདི་ལས་མངོན་པར་འདུས་བྱས་པ་གང་གིས་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་སུ་སྐྱེས།
en: If there were no “I” and “mine,” then what acts of karmic formation could have made us gods take birth in the Heaven of the Thirty-Three?’

source: ལྷའི་འཁོར་གཞན་གྱིས་སྒྲ་ཆེ་ཞིང་སྒྲ་གསལ་བར་སྨྲས་པ།
en: “Another group of gods responded, loud and clear,

source: གྲོགས་པོ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་གི་བསྟན་པ་ལ་སྐུར་བ་མ་འདེབས་ཤིག །
en: ‘Friends, do not denigrate the teaching of the blessed buddhas.

source: ལྟས་ལྔ་དག་བྱུང་ནས་ལྷའི་བུ་དག་འཆི་ཞིང་སྐྱེ་བ་ནི་ཁྱེད་ཀྱི་མངོན་སུམ་ཡིན་ཏེ
en: When the five signs appear, gods die and take rebirth. This you know from your own direct perception.

source: ཅི་ལྷའི་བུ་འཆི་བའི་བདག་པོ་མཐོང་ངམ།
en: But do you see any self of the dying god?

source: བདག་ལ་གནོད་པ་དེ་དག་གང་ཞེ་ན་གང་དུ་བདག་ཅག་ཐམས་ཅད་འདུས་ཀྱང་ལྷའི་བུ་དེ་གནོད་པ་ལས་ཡོངས་སུ་བསྒྲལ་བར་བྱ་མི་ནུས་ཏེ
en: How, one may wonder, could a self be harmed in any of those ways? And yet even if we all unite we cannot save a god from harm.

source: ལྟས་དང་པོ་ལ་བདག་མི་སྣང་ངོ་། །
en: At the first sign no self appears,

source: ལྟས་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་དང་། ལྔ་པ་ལ་བདག་མི་སྣང་ཞིང་འཆི་བར་འདོད་པའི་བདག་མི་སྣང་།
en: and no self can be claimed to appear at the second, third, fourth, or fifth sign either.

source: འཆི་བ་དང་ཤི་བའི་བདག་མི་སྣང་སྟེ།
en: We see no self of the dead and dying.

source: འདི་ལ་བདག་དང་བདག་གི་མེད་ཅིང་ཆོས་ཐམས་ཅད་ནི་བདག་གམ་བདག་གིས་སྟོང་སྟེ།
en: Here there is neither self nor anything that is of a self. All phenomena are devoid of self and anything that belongs to it.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ནི་ཡང་དག་པ་གསུང་བའོ།
en: And thus the words of the blessed buddhas are genuine.’

source: དེ་ནས་རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་ཀྱིས་རྒྱལ་པོ་ཁྲི་ཕྲག་དགུ་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “King Topmost Intelligence then spoke to the ninety thousand kings:

source: ཁྱེད་ཅག་གཅིག་ཏུ་འདུས་ཤིག །
en: ‘All of you, gather here!

source: ཀྱེ་མ་ལྷའི་འཁོར་འདི་དག་ནི་མི་འཐུན་ཏེ། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་མ་རྟོགས་སོ། །
en: Alas, this assembly of gods is in disagreement and lacks realization of the thus-gone ones’ teaching.

source: བདག་ཅག་རེ་ཞིག་འཛམ་བུའི་གླིང་ཉིད་དུ་ཆོས་བགྲོ་བ་བྱ་སྟེ།
en: So let us visit Jambudvīpa for a Dharma discussion.

source: གལ་ཏེ་ཆོས་ཐམས་ཅད་མི་སྟོང་ཞིང་གལ་ཏེ་བདག་དང་བདག་གི་ཡོད་པ་དེ་ཙམ་གྱི་ཕྱིར་བདག་ཅག་ལྷའི་འདུན་ཁང་དུ་ཆོས་བགྲོ་བར་འདོང་བར་བྱས་ན། ལྷའི་འཁོར་འདི་དག་ཕྱིན་ཅི་ལོག་ལ་ཞུགས་ཏེ། སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་ཐེ་ཙོམ་དུ་མ་ཡོད་དོ། །
en: If we have now come to this divine assembly hall for Dharma discussions to suggest that phenomena are in fact not empty, and that there is both self and something that is of the self, then this gathering of gods is in error, harboring numerous doubts about the buddhas’ teaching.

source: ཚུར་ཤོག་བདག་ཅག་འཛམ་བུའི་གླིང་དུ་ཆོས་བགྲོ་བར་བྱའོ། །
en: So come, let us go to Jambudvīpa to have a Dharma discussion!’

source: དེ་ནས་འཁོར་དེ་དག་ཕྱོགས་གཅིག་ཏུ་དོང་ནས། རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “The kings gathered in a group and then said to King Topmost Intelligence,

source: ཁྱོད་ནི་ཡུལ་དབུས་སུ་སྐྱེས་པ་ལགས་ཏེ། ཤར་ཕྱོགས་ཀྱི་མཐའ་འཁོབ་དང་། ནུབ་ཕྱོགས་ཀྱི་མཐའ་འཁོབ་དང་། བྱང་ཕྱོགས་ཀྱི་མཐའ་འཁོབ་དང་། ལྷོ་ཕྱོགས་ཀྱི་མཐའ་འཁོབ་ཏུ་མ་ལགས་སོ། །
en: ‘You were born in the central country, not in any of the outlying realms of the east, west, north, or south.

source: ཁྱོད་ནི་མངོན་པར་མཁྱེན་པ་ཆོས་འདིའི་ཚུལ་ལགས་སོ། །
en: Your understanding is expressed in this Dharma.’

source: དེ་ནས་རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་ཀྱིས་མཐའ་འཁོབ་ཀྱི་རྒྱལ་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “King Topmost Intelligence then spoke to the kings of the outlying realms:

source: ཁྱེད་ཅག་རེ་ཞིག་ཤར་ཕྱོགས་ནས་རྒྱལ་པོ་ཉི་ཤུ་རྩ་ལྔ། ནུབ་ཕྱོགས་ནས་རྒྱལ་པོ་ཉི་ཤུ་རྩ་ལྔ། བྱང་ཕྱོགས་ནས་རྒྱལ་པོ་ཉི་ཤུ་རྩ་ལྔ། ལྷོ་ཕྱོགས་ན་རྒྱལ་པོ་ཉི་ཤུ་རྩ་ལྔ་སྟེ།
en: ‘Choose twenty-five kings from the east, twenty-five kings from the west, twenty-five kings from the north, and twenty-five kings from the south.

source: གང་མཛངས་པ་དང་། མཁས་པ་དང་དཔྱོད་པ་དང་རྟབ་རྟབ་པོ་མ་ཡིན་པ་དང་། བརྟགས་པ་མ་ཡིན་པ་དང་། འཁྲུལ་པ་མེད་པ་དང་། རིངས་པ་མེད་པ་དང་། གང་བདག་གི་རྒྱུད་འབྱེད་པར་ནུས་པ་བརྒྱ་ཞིག་ཡང་དག་པར་ཁྲོ་བས་ཤིག །
en: The one hundred kings must be astute, learned, intelligent, not fickle, not making things up, not confused, not hurried, and they must be capable of examining their own stream of being.’

source: རྒྱལ་པོ་དེ་དག་གིས་བཀའ་བཞིན་འཚལ་ཞེས། རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་དེའི་ལྟར་མཉན་ནས་རྒྱལ་པོ་བརྒྱ་བཀྲབས་སོ། །
en: “ ‘As you wish,’ replied the kings, and so they selected one hundred kings in accordance with King Topmost Intelligence’s directions.

source: དེ་ནས་རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་རྒྱལ་པོ་བརྒྱ་དང་ལྷན་ཅིག་ཏུ། འདི་ལྟ་སྟེ་དཔེར་ན། ངང་པའི་རྒྱལ་པོ་བཞིན་དུ་རྫུ་འཕྲུལ་ཆེ་བས་གངས་རིའི་རྒྱལ་པོ་ལ་ཡང་དག་པར་གནས་སོ། །
en: “Arriving there like the king of swans, King Topmost Intelligence now miraculously took up residence upon the king of snow mountains together with the one hundred kings.

source: དེར་དེ་དག་གིས་འཁོར་གྱི་ཁྱམས་ལྷས་སྤྲུལ་པ་བྱུང་སྟེ། ལྷའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་དག་དང་མངོན་སུམ་དུ་གྱུར་ཏོ། །
en: Through divine emanation a courtyard appeared there, which remained perceptible to all of the divine kings.

source: དེ་ནས་རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་ཀྱི་སྟན་རྒྱལ་པོ་བརྒྱ་པོ་དེ་དག་གི་དབུས་སུ་བཤམས་སོ། །
en: [The gods of the Heaven of the Thirty-Three then created a throne for King Topmost Intelligence out of the seven precious substances] and placed it in the middle of the group of one hundred kings.

source: དེ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་དག་གིས་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པར་མངོན་པར་སྤྲུལ་ཏོ། །
en: The gods of the Heaven of the Thirty-Three then created a throne for King Topmost Intelligence out of the seven precious substances [and placed it in the middle of the group of one hundred kings.]

source: དེ་ནས་རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་ཀྱིས། ཕྱོགས་བཅུར་ཕྱག་བྱས་ནས་སྟན་དེ་ལ་འདུག་གོ། །
en: Having prostrated in the ten directions, King Topmost Intelligence then took seat upon his throne,

source: རྒྱལ་པོ་དགུ་བཅུ་རྩ་དགུ་པོ་དེ་དག་གིས་དེའི་རྐང་བ་ལ་ཕྱག་བྱས་ནས་འཁོར་དུ་འདུག་གོ། །
en: while the ninety-nine other kings bowed to his feet and gathered around him.

source: སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་དེ་དག་དགའ་ཞིང་མགུ་ལ་ཡི་རངས་པར་གྱུར་ཏེ།
en: “The gods of the Heaven of the Thirty-Three witnessed this with joy, delight, and appreciation.

source: འཛམ་བུའི་གླིང་གི་མི་རྣམས་ནི་དམ་པའི་ཆོས་དང་མངོན་དུ་གྱུར་ཏེ།
en: ‘The sacred Dharma,’ they thought, ‘is manifest for the humans of Jambudvīpa.

source: རེ་ཞིག་དམ་པའི་ཆོས་ནུབ་པར་མི་འགྱུར་རོ་སྙམ་ནས།
en: For a while still the sacred Dharma shall not fade.’

source: དེའི་ཚེ་ལྷ་དེ་དག་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་ཕབ་ཅིང་མགུ་བར་གྱུར་ནས་ཇི་ལྟར་འདིར་དམ་པའི་ཆོས་ཉན་པར་འདོད་ནས་འཁོད་དོ། །
en: The gods then let a rain of divine mandārava flowers fall, and they gathered happily to listen to the sacred Dharma.

source: དེ་ནས་རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་ཀྱིས་རྒྱལ་པོའི་ཕོ་ཉ་གཞན་ཞིག་ལ་སྨྲས་པ།
en: “At this point King Topmost Intelligence spoke to a royal messenger:

source: གྲོགས་པོ་གངས་རིའི་རྒྱལ་པོ་འདིའི་རྩེ་མོའི་དབུས་ན་དྲང་སྲོང་དགེ་བའི་བློ་གྲོས་ཞེས་བྱ་བ་གནས་ཏེ
en: ‘Friend, upon the summit of this snow mountain lives a sage by the name of Sādhumati.

source: རྒྱལ་པོའི་འཁོར་འདུས་པ་དེ་དག་ཁྱོད་མཐོང་བར་འཚལ་ལོ་ཞེས་དེ་སྤྱན་དྲོངས་ཤིག །
en: Please go and invite him here, and let him know that these kings wish to see him.’

source: རྒྱལ་པོའི་ཕོ་ཉ་དེས་བཀའ་བཞིན་འཚལ་ཞེས་རྒྱལ་པོ་དེའི་ལྟར་མཉན་ནས་ འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་སྟོབས་དང་ལྡན་པའི་ལག་ངར་བསྐུམ་པ་ལས་རྐྱོང་བའམ། བརྐྱང་བ་ལས་སྐུམ་པ་དེ་བཞིན་དུ་རྒྱལ་པོའི་ཕོ་ཉ་དེ་རྒྱལ་པོའི་འཁོར་དེའི་མདུན་ནས་མི་སྣང་བར་སོང་སྟེ
en: “ ‘As you wish,’ replied the messenger and so, as fast as an athlete can bend or stretch an arm, he disappeared from the royal gathering and reappeared before the sage.

source: དྲང་སྲོང་དེའི་རྐང་པའི་དྲུང་དུ་ཕྱིན་ནས་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། རང་བཞིན་དེ་དག་སྨྲས་སོ། །
en: The messenger bowed his head to the sage’s feet, and then explained to him the character of his errand.

source: དེ་དེ་བཞིན་གཤེགས་པས་འཛིན་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེའི་མྱ་ངན་ལས་འདས་པའི་སྒྲ་དག་ཐོས་ཤིང་རང་བཞིན་དེ་དག་ཤེས་ནས་སྙིང་རྗེ་བའི་ཕྱིར་མཆི་མ་བྱུང་ངོ་། །
en: When the sage heard about the thus-gone Bhūbhṛta’s having passed beyond suffering, and of what had transpired since then, he shed tears of compassion.

source: དེའི་མཆི་མ་དེ་དག་གི་རྒྱུན་དང་། མཆི་མ་དེ་དག་གི་དྲོད་ཀྱིས་གངས་རིའི་རྒྱལ་པོའི་རྩེ་མོ་ཞུའོ། །
en: As the sage’s tears flowed, their warmth melted the cape of the king of snow mountains.

source: དེ་མཆི་མ་དེ་དག་ཕྱིས་ནས་རྒྱལ་པོའི་ཕོ་ཉ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then he said to the messenger,

source: གྲོགས་པོ་གལ་ཏེ་གང་དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་བའམ། ཐོས་པའི་སེམས་ཅན་གང་དག་ཡོད་དམ། དམ་པའི་ཆོས་གནས་ཏེ།
en: ‘Friend, since there are beings who have seen and listened to that thus-gone one, the sacred Dharma remains.

source: དམ་པའི་ཆོས་མ་ནུབ་བོ། །
en: It has not faded.

source: ཁྱེད་སོང་ཤིག་ང་ནི་མི་འགྲོའོ། །
en: Leave on your own, I shall not go.

source: ང་དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཞི་བ་བཏང་ནས་འདུ་འཛིར་འཇུག་མི་ཕོད་དོ། །
en: I do not wish to let go of the peaceful rest of the thus-gone ones, and instead involve myself in mundane diversions.’

source: སྨྲས་པ་གྲོགས་པོ་འདི་ལ་བདག་ཡོད་དོ། །
en: “The sage then continued: ‘Friend, let me resolve the issue [that the gods are debating about whether there is a self or not.]

source: བདག་མེད་དོ་ཞེས་ལྷ་རྣམས་དང་རྩོད་པ་བྱུང་བ་དེའི་བྱས་པ་འདི་ཁྱོད་ལ་ཚོལ་ལོ། །
en: [‘Friend, let me resolve the issue that] the gods are debating about whether there is a self or not.

source: དེས་སྨྲས་པ་གལ་ཏེ་བདག་ཡོད་ན་མི་རྒ་མི་འཆི་མིན་པའི་རིགས་ཏེ།
en: If there were a self, there ought to be no aging, death, or disease.

source: བདག་ལ་སྐྱེ་བའམ། རྒ་བའམ། འཆི་བ་མེད་ཅིང་དེ་སྦྱིན་པ་ལ་དགའ་བར་མི་འགྱུར་ཏེ་དེ་བས་ན་བདག་མེད་དོ། །
en: Because the self is not born, does not age, does not die, and does not appreciate generosity. Therefore, there is no self.’

source: དེ་ལ་དེ་སྐད་བསྟན་པས་དེའི་ཆོས་ཀྱི་མིག་ཆོས་རྣམས་ལ་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ཏེ་རྣམ་པར་དག་གོ། །
en: “When the sage gave this teaching the messenger attained the dustless and stainless Dharma eye that sees the teachings.

source: དེ་ནས་ཕོ་ཉ་དེ་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་ངང་པའི་རྒྱལ་པོ་ལྟར་རྒྱལ་པོ་དེ་དག་གི་འཁོར་དུ་སོང་ངོ་། །
en: Flying through the sky like the king of swans, he returned to the group of kings.

source: དེའི་བར་སྣང་ལས་འོང་བཞིན་དུ་སྒྲ་བྱུང་བ།
en: In approaching, he spoke to them from sky:

source: གྲོགས་པོ་དག་དམ་པའི་ཆོས་གནས་ཏེ། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་འབར་རོ། །
en: ‘Friends, the sacred Dharma remains, the teaching of the thus-gone ones is ablaze.

source: གང་དག་མངོན་པར་བརྩོན་པས་ནི་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལས་སྙིང་པོ་ལེན་ཏོ། །
en: Whoever applies effort will be able to extract the essence of the thus-gone ones’ teachings.

source: མངོན་པར་བརྩོན་པ་མེད་པ་དག་ལ་ནི་སངས་རྒྱས་འབྱུང་བ་མེད།
en: For those who lack diligence no buddha appears,

source: ཆོས་ཐོས་པ་མེད་དམ་པའི་ཆོས་འཛིན་པ་མེད་དེ།
en: no Dharma is heard, and no Dharma will be comprehended.

source: དེ་མི་བརྩོན་པས་གང་དེ་དག་ཕྱིར་ལྡོག་པར་བྱེད་དོ། །
en: Lacking diligence, they will regress.

source: གང་མངོན་པར་བརྩོན་པ་ལ་དམ་པའི་ཆོས་གནས་ཏེ།
en: Yet for the diligent the Dharma remains:

source: འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་པའོ། །
en: “All that is conditioned is impermanent;

source: འདུ་བྱེད་ཐམས་ཅད་སྡུག་བསྔལ་བའོ། །
en: all that is conditioned is suffering;

source: ཆོས་ཐམས་ཅད་བདག་མེད་པའོ། །
en: all phenomena are devoid of self;

source: མྱ་ངན་ལས་འདས་པ་ནི་ཞི་བའོ་ཞེས་ཤེས་སོ། །
en: passing beyond suffering is peace.”

source: དེའི་སྒྲ་དེ་ཕྱོགས་བཅུར་རླུང་གིས་ཁྱེར་རོ། །
en: The winds carry these words throughout the ten directions!’

source: དེའི་སྒྲ་དེ་ཐོས་ནས་གང་བདག་ཏུ་སྨྲ་བ་དེ་དག་ནི་བདག་མེད་པ་ལ་གནས།
en: “Upon hearing these words those who were proponents of a self came to abide within the absence of self,

source: གང་བདག་མེད་པར་སྨྲ་བ་དེ་དག་ནི་བྱ་བ་བྱས་པར་གྱུར་ཏེ།
en: and those who were proponents of no-self completed their tasks.

source: དེ་དག་ཐམས་ཅད་ཏོག་གི་བློ་གྲོས་ཀྱི་མཐུའོ། །
en: All of that happened due to Topmost Intelligence’s power.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time King Topmost Intelligence was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཏོག་གི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the King Topmost Intelligence

source: ངས་སྐྱེ་བོ་དེ་དག་ཐམས་ཅད་ཆོས་ལ་རབ་ཏུ་བཙུད་དོ། །
en: and thus I established all those beings in the Dharma.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྒྲས་གོ་བར་བྱས་ཏེ།
en: I caused the words of the teachings to be heard throughout the entire trichiliocosm and,

source: ཇི་ལྟར་འདིར་སྔོན་གྱི་སྤྱོད་པས་སངས་རྒྱས་ཁྲི་དག་ལ་བསྙེན་བཀུར་བྱས་ཏེ།
en: because I had served tens of thousands of buddhas in the past, I had great compassion for sentient beings.

source: སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་ནས་སྒྲ་དེ་བཏང་ངོ་། །
en: That is how the words of Dharma emerged.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་བག་ཚབ་མེད་པའི་ཤེས་པས་སེང་གེའི་སྒྲ་བསྒྲག་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattva great beings must emit the lion’s roar free from any shyness concerning the blessed buddhas’ teachings.

source: མཽད་གལ་གྱི་བུ་ངས་སྐྱེ་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་ནས་མངོན་པར་འདུས་བྱས་པའི་བར་དུའང་དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the origin as related to knowledge of birth. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the origin as related to knowledge of birth.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་བརྒྱ་པ་ཞེས་བྱ་བ་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a thus-gone one named Hundreds of Light Rays.

source: འཇིག་རྟེན་གྱི་ཁམས་ཡང་དག་པར་འདུ་བ་འདིར་རྟག་ཏུ་གནོད་པ་དང་བྲལ་བ་ཡིན་ཏེ་འཇིག་པ་དང་འཆགས་པ་དང་བྲལ་ལོ། །
en: At that time this universe remained free from harm, abiding without disintegration or formation.

source: འོད་ཟེར་དེ་རེ་རེ་ལས་སངས་རྒྱས་ཀྱི་སྤྲུལ་པ་དཔག་ཏུ་མེད་པ་དག་བྱུང་སྟེ།
en: From each light ray there would appear innumerable buddha emanations,

source: དེ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པར་སྤྲུལ་པ་དེ་དག་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་ཇི་ལྟར་མོས་པ་ཇི་ལྟར་མོས་པར་སྤྲུལ་པས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: streaming out into innumerable universes of the ten directions. These emanations, who were in perfect accord with the wishes of beings, matured innumerably many tens of thousands of beings.

source: ཇི་ལྟར་སེམས་ཅན་དེ་དག་གི་བསམ་པ་དེ་ལྟར་སྤྲུལ་པ་དེ་དག་གིས་སེམས་ཅན་དེ་དག་ལ་ཆོས་སྟོན་ཏོ། །
en: These emanations taught the Dharma in agreement with the inclinations of beings.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པར་གྱུར་ཏེ། ཐམས་ཅད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྤྲུལ་པ་དག་གིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: In this manner the buddha realm of that thus-gone one encompassed innumerable trichiliocosms throughout which emanations were ripening sentient beings,

source: བདག་ཉིད་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པར་བཞུགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མེད་པ་དག་སྨིན་པར་མཛད་དོ། །
en: and so the Thus-Gone One himself resided in boundless buddha realms, bringing innumerable bodhisattvas to maturation.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེའི་རིམ་གྲོ་པ་དགེ་སློང་མིག་ཉམས་པ་མེད་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “At that time there was a monk known as Flawless Eyes who was serving the Thus-Gone One,

source: དེ་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་གང་གིས་སེམས་ཅན་དག་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་བསམ་པ་ལ་མཁས་སོ། །
en: and he knew well the thoughts of all the beings whom the Thus-Gone One’s emanations were ripening.

source: གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེ་ཆོས་སྟོན་པར་མཛད་པ་དེའི་ཚེ་དེ་སེམས་ཅན་དེ་དག་ལ་ཆོས་སྟོན་ཏོ། །
en: Whenever the Thus-Gone One would teach the Dharma, the monk would do the same.

source: དེ་ཆོས་བསྟན་པ་ཐོས་ནས་རིམ་གྲོ་བྱེད་དོ། །
en: Whenever he heard the Thus-Gone One teach, the monk would offer his service.

source: སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་དེའི་རིམ་གྲོ་བྱས་པ་ཙམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་གྱུར་ཏོ། །
en: In this way innumerably many tens of thousands of beings awoke to unsurpassed and perfect buddhahood simply due to the service rendered by the monk.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རིམ་གྲོ་པ་དགེ་སློང་མིག་ཉམས་པ་མེད་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the monk Flawless Eyes was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་མིག་ཉམས་པ་མེད་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was that monk Flawless Eyes.

source: ངས་དེ་བཞིན་གཤེགས་པ་དེའི་ཆོས་བསྟན་པ་ཐོས་ནས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: Having heard the Thus-Gone One’s Dharma teaching, I established innumerably many tens of thousands of beings at the irreversible level.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པའི་ཆོས་བསྟན་པ་དག་དང་ཕྲད་པར་བྱས་ནས་སེར་སྣ་མེད་པས་དེ་བཞིན་གཤེགས་པའི་ཆོས་བསྟན་པ་མཉན་པར་བྱ། བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཡོངས་སུ་སྨིན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, when bodhisattvas come into contact with the Dharma teachings of the thus-gone ones, they must, without any stinginess, ensure that the thus-gone ones’ teachings are heard and bodhisattvas are ripened.

source: མཽད་གལ་གྱི་བུ་ངས་སྐྱེ་བ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་མངོན་པར་འདུས་བྱས་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་ཡང་དག་པར་རབ་ཏུ་བསྟན་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand cessation as related to knowledge of birth. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of cessation as related to knowledge of birth.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་འོད་མཐའ་ཡས་ཞེས་བྱ་བ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a thus-gone one by the name of Anantaprabha;

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་སྤྱོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཏེ། སྔོན་གྱི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པའི་སེམས་ཅན་གཡོ་མེད་པ། སྒྱུ་མེད་པ་དྲང་པོའི་རང་བཞིན་ཅན། འཇིག་རྟེན་ཕ་རོལ་གྱི་ཁ་ན་མ་ཐོ་བ་ལ་འཇིགས་པར་ལྟ་བ་རྣམས་ཀྱིས་གང་ངོ་། །
en: At that time the conduct of the beings of the world was excellent, because the world was full of beings with excellent past deeds, who were of an honest nature, free from deceit and deception, and who were fearful of the consequences of evil in lives to come.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲག་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “At that time there appeared in that buddha realm a bodhisattva named Noble Splendor.

source: བྱང་ཆུབ་སེམས་དཔའ་འབུམ་ཕྲག་བརྒྱད་རྣམས་ཀྱི་གཙོ་བོ་ཡིན་ལ། ཐབས་མཁས་པ་དང་ལྡན་པ།
en: Chief among eight hundred thousand bodhisattvas, he was a master of skillful means.

source: སེམས་ཅན་རྣམས་ཀྱི་བྱ་བ་ལ་མཁས་པ། སེམས་ཅན་རྣམས་ཀྱི་ཆོས་སྟོན་པ་ལ་མཁས་པ།
en: Noble Splendor was expert in the activities of sentient beings, and he knew very well how to teach them the Dharma,

source: སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འགྲོ་བའི་དུས་ལ་མཁས་པ་སེམས་ཅན་རྣམས་ལ་དེ་དང་འཚམ་པའི་ཆོས་སྟོན་པ་ལ་མཁས་པ།
en: when to approach them, and which Dharma teaching would be appropriate for which being.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་ལྡན་ནོ། །
en: He was endowed with boundless bodhisattva qualities.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲག་པས། དེ་བཞིན་གཤེགས་པ་འོད་མཐའ་ཡས་དེ་ལ་བལྟས་ནས། །སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་རྒྱུ་ཞིང་སོང་ངོ་། །
en: “The bodhisattva Noble Splendor set out to see the thus-gone Anantaprabha, traveling from one buddha realm to the next.
